cases/3D/Bn0p10_hr1_cap2_dom3_mesh120/system/blockMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }
scale 1;
// valette1to1 3Dcyl DOMAIN-3 mesh-conv: 3x3x1.5, mesh 120x120x60=864000 (dx=0.025, 40 cells/r0).
// Domain Bn=0.01 (en cok yayilan, Valette r_inf~2.60) icin boyutlandirildi; yanal 3=3*r0 marji.
vertices ( (0 0 0) (3 0 0) (3 3 0) (0 3 0) (0 0 1.5) (3 0 1.5) (3 3 1.5) (0 3 1.5) );
blocks ( hex (0 1 2 3 4 5 6 7) (120 120 60) simpleGrading (1 1 1) );
edges ();
boundary
(
    bottom    { type wall;          faces ( (0 3 2 1) ); }
    atmosphere{ type patch;         faces ( (4 5 6 7) ); }
    xMin      { type symmetryPlane; faces ( (0 4 7 3) ); }
    yMin      { type symmetryPlane; faces ( (0 1 5 4) ); }
    xMax      { type wall;          faces ( (1 2 6 5) ); }
    yMax      { type wall;          faces ( (3 7 6 2) ); }
);
mergePatchPairs ();
